In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn import linear_model
import os

In [2]:
print(os.listdir())

['hiring.csv', '.ipynb_checkpoints', 'exercice.ipynb', 'tuto_01.ipynb', 'homeprices.csv']

In [3]:
df=pd.read_csv('hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

# 1) Data Processing

In [4]:
df.columns

Index(['experience', 'test_score(out of 10)', 'interview_score(out of 10)',
       'salary($)'],
      dtype='object')

In [5]:
from math import floor
median_test_score=floor(df['test_score(out of 10)'].median())
median_test_score

8

In [6]:
df['test_score(out of 10)'][6]=median_test_score
df

/tmp/ipykernel_19136/1154442771.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['test_score(out of 10)'][6]=median_test_score
/tmp/ipykernel_19136/1154442771.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['test_score(out of 10)'][6]=median_test_score

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [7]:
pip install word2number

Requirement already satisfied: word2number in /home/lyes-rahal/Documents/web/python/pandas/venv/lib/python3.12/site-packages (1.1)
Note: you may need to restart the kernel to use updated packages.

In [8]:
from word2number import w2n
df['experience']=df.experience.apply( 
    lambda x: w2n.word_to_num(x) if isinstance (x,str) else x 


#isinstance ?
#C’est une fonction Python qui sert à vérifier le type d’une variable.
    # isinstance(variable, type)
        # print(isinstance(''hello, str))  ==> True

In [9]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0         NaN                    8.0                           9      50000
1         NaN                    8.0                           6      45000
2         5.0                    6.0                           7      60000
3         2.0                   10.0                          10      65000
4         7.0                    9.0                           6      70000
5         3.0                    7.0                          10      62000
6        10.0                    8.0                           7      72000
7        11.0                    7.0                           8      80000